Autodesk.Revit.DB.ThermalProperties.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ThermalProperties.ThermalMass
The calculated thermal mass value.
The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).
Since:
2013

Autodesk.Revit.DB.ThermalProperties.ThermalResistance
The calculated thermal resistance value (R-Value).
The unit is meter-squared kelvin per watt ((m^2*K)/Watt).
Since:
2013

Autodesk.Revit.DB.ThermalProperties.HeatTransferCoefficient
The heat transfer coefficient value (U-Value).
The unit is watts per meter-squared kelvin (W/(m^2*K)).
Since:
2013

Autodesk.Revit.DB.ThermalProperties.Roughness
Value of roughness.
Since:
2013

Autodesk.Revit.DB.ThermalProperties.Absorptance
Value of absorptance.
Since:
2013

Autodesk.Revit.DB.ThermalProperties
Class specific to thermal properties for assembly types, such as Wall,
Floor, Ceiling, Roof and Building Pad.
Since:
2013